[
  {
    "path": "posts/",
    "title": "What is a Data analyst?",
    "description": "We have all been hearing data analyst, junior data analyst, data consultant and most people develop interest without even knowing what it actually entails.",
    "author": [
      {
        "name": "Oyemade Emmanuel",
        "url": {}
      }
    ],
    "date": "2023-02-17",
    "categories": [],
    "contents": "\r\nWhat is a Data Analyst?\r\nI have heard a whole lot of “definitions” or should I say descriptions of what a data analyst is or let’s just say should be. Some people believe being a data analyst qualifies you to be called a machine learning scientist and at times people just straight up call you a data scientist. Even though they are similar to an extent, a data analyst still differs from a data scientist in some ways.\r\nA data analyst role is one which cannot be overlooked in various industries as it helps make the decision making process much more easier(not easier but more conscious) and data oriented.So, we get back to who and what a data analyst is?\r\nA data analyst simply put is one who identifies key insights in data, discovers ways the data can be used to solve problems, and then communicate this information to stakeholders.Most firms need the service of a data analyst for help in making sense of their data, research, profit making, to cut cost or all of the above.\r\nWhat does being a Data Analyst mean to me?\r\nWe know what it means to be a data analyst in general, now lets us talk about what being a data analyst means to me. So, I have been working as an adviser at my father’s company for a while now(it was not an official job then), but I had to go learn the skills of a data analyst to be able to do more and for a while I have done the duties of one but what does it really mean to be a data analyst.First, I have done a lot of data entry as most of the data was on paper, making use of Microsoft Excel and its wonderful pool of resources like data validation, then some data cleaning(this is much easier cause I did the entry myself), then the analysis. What I failed to understand at first was the fact that when reporting, you have to write with your target audience in mind throughout, your use of terminologies has to align with the audience, you have to think about what bracket they fall into as not all target audience are professionals with knowledge of those terminologies, making use of basic English would suffice most times. But working on various projects and programs have made me come to a realization that being a data analyst involves a whole lot of data cleaning(a whole lot), you spend a lot of time cleaning data and validating data, it is a boring process but most learning/experience is gained in the process(this is why I enjoy data cleaning) and let’s face it, what useful information can you get from unclean data. After data cleaning, you do some joining and summarizing of your data and gathering of insights( some KPI definition) then you communicate your results.\r\nWhat tools do Data Analysts use?\r\nA whole lot of small businesses make use of Microsoft Excel for data analysis since they do not own large amounts of data, and trust me you might end up not using more than that as a data analyst. Professionally, I do not make use of any tool other than Microsoft Excel for data analysis but personally , I use PostgreSQl, Microsoft PowerBI, R and Tableau once in a while. And I personally think as a data analyst, one should be able to make use of at least SQL, Spreadsheets and one visualization tool/BI tool. I am not going to give a career map but just for information sake, I would advise learning in this direction; Spreadsheets(Microsoft Excel or Google Sheets) to SQL(any flavor) to visualization tool(Microsoft PowerBI or Tableau or any other tool) then Statistical language(Python or R). Knowledge of tools such as Microsoft Powerpoint and Microsoft Word is also advised.\r\nConclusion\r\nSincerely, I had to make this article as short as possible as it is just an introduction to what it actually means to be a data analyst(both in general and to me). To me , being a data analyst means continuous hunger for knowledge, wanting to learn and know more. Indicators change from time to time, businesses face challenges and you have to be ready to tackle those challenges. I always say the ability to Google search is also a skill that you need to have, there is billions of information out there that can help you grow as much as needed. Lastly, when you are learning skills, look for ways to apply them, it is not the skills that matter but how well you know how to apply it. Some other time, I would write about resources that helped me learn and grow as a Data analyst.\r\nThank you for reading!\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-02-17T16:31:36+01:00",
    "input_file": "Data-analyst.knit.md"
  },
  {
    "path": "posts/2023-02-14-my-experience-working-on-kpmg-virtual-internship/",
    "title": "KPMG virtual internship experience",
    "description": "This is a simple blog about the  experience I had when I took part in the KPMG virtual internship on theforage website, a challenging yet ye-opening experience..",
    "author": [
      {
        "name": "Oyemade Emmanuel",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2023-02-14",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nAbout KPMG\r\nAbout KPMG virtual internship\r\nInternship process\r\nConclusion\r\n\r\nLittle or no experience is gained when students get introduced to the technological world. When I was learning processes in data, I had no practical experience and I gained only technical skills. Companies all over the world have started investing in helping students, interns(both undergraduate and graduate) gain technical experience.\r\nAbout KPMG\r\nKPMG is a global network of professional firms providing Audit, Tax and Advisory services.KPMG delivers services in 164 countries all around the world.\r\nKPMG helps clients all around the world make decisions consciously and help make more informed decisions, help with risk analysis and also help grasp opportunities that are hard to see or come by.\r\nAbout KPMG virtual internship\r\nWith the help of TheForage , KPMG has been able to empower employees and interns(referred to as trainees from here on) all around the world with the skills that are highly demanded by big shot companies. This program helps prepare trainees as data consultants(junior).\r\nHelping trainees make use of their skill for relevant tasks that prepare them for the future and the career ahead of them. The trainees are challenged to use software such as Microsoft excel, Power point and also Microsoft Word. The challenges are quite tricky but nothing trainees whom have gone through the learning process would not be able to tackle, this training helps trainees be able to use their own initiative to tackle challenges, then they are given the opportunity to reflect on their work and the mistakes made by going through an experts example (trainees are advised to make use of this as a template for correction).\r\nInternship process\r\nThe internship starts off from an introductory video from an executive of KPMG introducing trainees to the company and what they have to gain partaking in the virtual program, trainees are made to know that the tasks are daily activities carried out by regular employees of KPMG on daily basis. The tasks trainees would be carrying out are then introduced briefly.\r\nTask 1 : Data Quality Assessment\r\nThis is the first task to be done on this program, trainees are employed to check out the data and assess it for flaws (basic data quality assessment), trainees check data qualities such as data integrity, duplicates, data completeness, data relevance and so on. Trainees are not expected to correct this observations but instead draft an email telling the client about the findings from your data quality assessment.\r\nTask 2 : Data Insights\r\nIn this task, trainees are expected to make a Power point presentation on the process carried out by the company, this presentation should contain the process taken including data exploration , model development , and interpretation and reporting. Trainees are expected to explain to the client how they are going to go about the analysis fo the data.\r\nTask 3 : Data Insights and Presentation\r\nIn the final task of this program, trainees are expected to create a dashboard that can be presented to the client. This dashboard/ report should not exceed three(3) pages and should contain relevant KPIs, this report would contain the company logo which has been provided for the trainees.\r\nConclusion\r\nThis program has been able to not only bridge the gap between students and real world experience but also help employees attain relevant skills to be able to keep their jobs in the fast paced technological world. This program is completely free and you get to do it at our own pace. You are not expected to know it all and that is why you are employed to make use of the internet as much as you can and re do the tasks as much as you can till you are satisfied with your own answer(solution). At the end of this program, you would understand what being a data analyst/ consultant entails and you would be able to make decisions if this is a path you would want to pursue based on first hand experience. There are also other programs from top companies on Theforage that you can take.\r\nThank you for reading! I am Oyemade Emmanuel, a Certified Associate Data Analyst by Microsoft and DataCamp.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-02-15T12:44:45+01:00",
    "input_file": "my-experience-working-on-kpmg-virtual-internship.knit.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to my blog",
    "description": "This is just a place where I write, and write and write. Welcome to my world, where I talk about data and some other random stuffs.",
    "author": [
      {
        "name": "Oyemade Emmanuel",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2023-02-14",
    "categories": [],
    "contents": "\r\nOyemade Emmanuel\r\nThe question I ask at times is who am I , what do people think when my name is mentioned. Well, I do not have an answer to what people think about me but I do have one for who I want to be; an innovator, an helper , a person who is not scared to go beyond the limits and is ready to do more everyday. Having that in mind, I try to do more every single day, I try to learn more and try more every day. At the end of it all, I want my decisions to have impacted enough lives around the world to grow and help people through my actions.\r\nI am a Chemical Engineering student that believes in constant growth. I have going through various training and courses and I have been able to acquire a number of skills,but my ability to Google search is my most priced skill as it helps me get through situations much easily. My ability to find what I need off the internet has helped me grow and keep growing.\r\nI have also been able to get a bunch of resources on the internet which hopefully, I would be able to share someday.\r\nI enjoy singing, researching, listening to podcast(Dataframed) and song writing in my free time, helps me keep my mind off a lot of things. I am taking up blogging as one of my leisure engagement.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-02-17T13:33:56+01:00",
    "input_file": "welcome.knit.md"
  }
]
